In [4]:
import pandas as pd
from sqlalchemy import create_engine
# Connect to sqlite db
db_file = r'datasets/gradedata.db'
engine = create_engine(r"sqlite:///{}"
 .format(db_file))
sql = 'SELECT * from test'
'where Grades in (76,77,78)'
sales_data_df = pd.read_sql(sql, engine)
sales_data_df

   index    Names  Grades
0      0      Bob      76
1      1  Jessica      95
2      2     Mary      77
3      3     John      78
4      4      Mel      99